## Question 1
1.	Explore inner join; outer join; left join and right join respectively.

In [14]:
import pandas as pd 
#First DataFrame 
data1 = {
    'StudentID' :[1,2,3,4],
    'Name': ['Alice','Bob','Charlie','David']
}
df1 = pd.DataFrame(data1)
#Second DataFrame
data2 = {
    'StudentID': [3,4,5,6],
    'Grade': ['A', 'B','C','D']
}
df2 = pd.DataFrame(data2)

In [15]:
df1

   StudentID     Name
0          1    Alice
1          2      Bob
2          3  Charlie
3          4    David

In [16]:
df2

   StudentID Grade
0          3     A
1          4     B
2          5     C
3          6     D

## Inner Join

In [17]:
pd.merge(df1,df2)

   StudentID     Name Grade
0          3  Charlie     A
1          4    David     B

## Outer Join

In [18]:
pd.merge(df1,df2, how= 'outer')

   StudentID     Name Grade
0          1    Alice   NaN
1          2      Bob   NaN
2          3  Charlie     A
3          4    David     B
4          5      NaN     C
5          6      NaN     D

## Left Join

In [19]:
pd.merge(df1,df2, how= 'left')

   StudentID     Name Grade
0          1    Alice   NaN
1          2      Bob   NaN
2          3  Charlie     A
3          4    David     B

## Right join

In [20]:
pd.merge(df1,df2, how= 'right')

   StudentID     Name Grade
0          3  Charlie     A
1          4    David     B
2          5      NaN     C
3          6      NaN     D

## Question 2
2.	Create a dataframe:
data = {
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    
    'Product': ['Widget', 'Widget', 'Gadget', 'Gadget', 'Widget', 'Gadget'],
    
     'Quantity': [4, 2, 3, 5, 6, 1]}

 -	Group the data by 'Salesperson' and calculate the total 'Quantity' sold by each salesperson.
 
 -	Group the data by 'Product' and find the average 'Quantity' sold.

In [27]:
import pandas as pd

# Create the DataFrame
data = {
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Product': ['Widget', 'Widget', 'Gadget', 'Gadget', 'Widget', 'Gadget'],
    'Quantity': [4, 2, 3, 5, 6, 1]
}

df = pd.DataFrame(data)

# Group by 'Salesperson' and calculate the total 'Quantity' sold by each salesperson
total_quantity_by_salesperson = df.groupby('Salesperson')['Quantity'].sum().reset_index()
print("Total Quantity Sold by Each Salesperson:")
print(total_quantity_by_salesperson)

# Group by 'Product' and find the average 'Quantity' sold
average_quantity_by_product = df.groupby('Product')['Quantity'].mean().reset_index()
print("\nAverage Quantity Sold by Each Product:")
print(average_quantity_by_product)

Total Quantity Sold by Each Salesperson:
  Salesperson  Quantity
0       Alice         9
1         Bob         8
2     Charlie         4

Average Quantity Sold by Each Product:
  Product  Quantity
0  Gadget       3.0
1  Widget       4.0